/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_sort_arg_dir.c                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: geliz <geliz@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/07 17:45:54 by geliz             #+#    #+#             */
/*   Updated: 2020/02/07 17:53:36 by geliz            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_ls.h"

void	ft_sort_arg_dirs(t_keylist *kl)
{
	t_fin	*first;

	first = kl->t_first;
	/*получить стат по каждому каталогу, отправить в сортировку, готово*/	
//	ft_sort_list(kl, &kl->t_first);
}
